Tekla Open API Reference for Tekla Structures 2025
BasePoint.InitialGuid Property
 Gets or sets the initial guid. A metadata field to store for example some external applications base point guid. Not used in itself in any functionality.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string InitialGuid { get; set; }
Public Property InitialGuid As String
	Get
	Set
Property Value
Type: String
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace